---
kind: property
id: P:Autodesk.Revit.DB.Transform.Identity
zh: 变换
source: html/2eb2a180-c7ef-a0c0-0fa4-baef2901c351.htm
---
# Autodesk.Revit.DB.Transform.Identity Property

**中文**: 变换

The identity transformation.

## Syntax (C#)
```csharp
public static Transform Identity { get; }
```

## Remarks
The identity transformation does not change a point or a vector that it is applied to.